Revit 2027 API
ParameterTypeId.DoorFrameType Property
 "Frame Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DoorFrameType { get; }
Public Shared ReadOnly Property DoorFrameType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DoorFrameType {
	ForgeTypeId^ get ();
}
static member DoorFrameType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace